yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
/****************************************Copyright (c)****************************************************
**                         Guangzhou ZHIYUAN electronics Co.,LTD.                               
**                                     
**                               http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:           LPC32x0.h
** Last modified Date:  2008-09-19
** Last Version:        1.0
** Descriptions:        header file of LPC32x0 user may modify it as needed
**--------------------------------------------------------------------------------------------------------
** Created by:          Chenmingji
** Created date:        2004-02-02
** Version:             1.0
** Descriptions:        The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:         Wangfaqiang 
** Modified date:       2008-09-19
** Version:            
** Descriptions: 
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
#ifndef __LPC32X0_H
#define __LPC32X0_H

    /*
     * System Control 
     */
#define     SYSCTRL_BASE_ADDR	    0x40004000
#define     BOOT_MAP	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x14))

    /* 
     * Clock and Power Control 
     */
#define     CLK_PM_BASE_ADDR	    0x40004000
#define     PWR_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x44))
#define     OSC_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x4C))
#define     SYSCLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x50))
#define     PLL397_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x48))	
#define     HCLKPLL_CTRL	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x58))
#define     HCLKDIV_CTRL	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x40))
#define     TEST_CLK	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xA4))
#define     AUTOCLK_CTRL	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xEC))

#define     START_ER_INT	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x20))
#define     START_ER_PIN	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x30))
#define     START_RSR_INT	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x24))
#define     START_RSR_PIN	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x34))
#define     START_SR_INT	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x28))
#define     START_SR_PIN	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x38))
#define     START_APR_INT	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x2C))
#define     START_APR_PIN	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x3C))

#define     DMACLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xE8))
#define     USBDIV_CTRL             (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x1C)) 
#define     USBCLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x64))
#define     MS_CTRL		            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x80))
#define     TIMCLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xBC))
#define     SPI_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xC4))
#define     FLASHCLK_CTRL	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xC8))
#define     MACCLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x90))
#define     LCDCLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x54))
#define     I2S_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x7c))
#define     SSP_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x78))
#define     I2CCLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xAC))
#define     TIMCLK_CTRL1            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xC0))
#define     ADCLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xB4))
#define     ADCLK_CTRL1	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0x60))
#define     KEYCLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xB0))
#define     PWMCLK_CTRL	            (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xB8))
#define     UARTCLK_CTRL	        (*(volatile unsigned long *)(CLK_PM_BASE_ADDR + 0xE4))

    /* 
     * Interrupt Controller 
     */
#define     MIC_BASE_ADDR	        0x40008000
#define     MIC_ER		            (*(volatile unsigned long *)(MIC_BASE_ADDR + 0x00))
#define     MIC_RSR		            (*(volatile unsigned long *)(MIC_BASE_ADDR + 0x04))
#define     MIC_SR		            (*(volatile unsigned long *)(MIC_BASE_ADDR + 0x08))
#define     MIC_APR		            (*(volatile unsigned long *)(MIC_BASE_ADDR + 0x0C))	
#define     MIC_ATR		            (*(volatile unsigned long *)(MIC_BASE_ADDR + 0x10))
#define     MIC_ITR		            (*(volatile unsigned long *)(MIC_BASE_ADDR + 0x14))

#define     SIC1_BASE_ADDR	        0x4000C000
#define     SIC1_ER		            (*(volatile unsigned long *)(SIC1_BASE_ADDR + 0x00))
#define     SIC1_RSR	            (*(volatile unsigned long *)(SIC1_BASE_ADDR + 0x04))
#define     SIC1_SR		            (*(volatile unsigned long *)(SIC1_BASE_ADDR + 0x08))
#define     SIC1_APR	            (*(volatile unsigned long *)(SIC1_BASE_ADDR + 0x0C))
#define     SIC1_ATR	            (*(volatile unsigned long *)(SIC1_BASE_ADDR + 0x10))
#define     SIC1_ITR	            (*(volatile unsigned long *)(SIC1_BASE_ADDR + 0x14))

#define     SIC2_BASE_ADDR	        0x40010000
#define     SIC2_ER		            (*(volatile unsigned long *)(SIC2_BASE_ADDR + 0x00))
#define     SIC2_RSR	            (*(volatile unsigned long *)(SIC2_BASE_ADDR + 0x04))
#define     SIC2_SR		            (*(volatile unsigned long *)(SIC2_BASE_ADDR + 0x08))
#define     SIC2_APR	            (*(volatile unsigned long *)(SIC2_BASE_ADDR + 0x0C))
#define     SIC2_ATR	            (*(volatile unsigned long *)(SIC2_BASE_ADDR + 0x10))
#define     SIC2_ITR	            (*(volatile unsigned long *)(SIC2_BASE_ADDR + 0x14))

#define     SWI_BASE_ADDR	        0x40004000
#define     SW_INT		            (*(volatile unsigned long *)(SWI_BASE_ADDR + 0xA8))

