yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
    /* 
     * DMA  Control register  
     */ 
#define     DMA_GENERAL_BASE_ADDR   0x31000000
#define     DMACIntStat             (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x00))
#define     DMACIntTCStat           (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x04))
#define     DMACIntTCClear          (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x08))
#define     DMACIntErrStat          (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x0C))
#define     DMACIntErrClr           (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x10))
#define     DMACRawIntTCStat        (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x14))
#define     DMACRawIntErrStat       (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x18))
#define     DMACEnbldChns           (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x1C))
#define     DMACSoftBReq            (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x20))
#define     DMACSoftSReq            (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x24))
#define     DMACSoftLBReq           (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x28))
#define     DMACSoftLSReq           (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x2C))
#define     DMACConfig              (*(volatile unsigned long *)(DMA_GENERAL_BASE_ADDR + 0x30))
   
    /* 
     * DMA channel 0 
     */
#define     DMA_CHAN0_BASE_ADDR     0x31000100
#define     DMACC0SrcAddr           (*(volatile unsigned long *)(DMA_CHAN0_BASE_ADDR + 0x00))
#define     DMACC0DestAddr          (*(volatile unsigned long *)(DMA_CHAN0_BASE_ADDR + 0x04))
#define     DMACC0LLI               (*(volatile unsigned long *)(DMA_CHAN0_BASE_ADDR + 0x08))
#define     DMACC0Control           (*(volatile unsigned long *)(DMA_CHAN0_BASE_ADDR + 0x0C))
#define     DMACC0Config            (*(volatile unsigned long *)(DMA_CHAN0_BASE_ADDR + 0x10))
   
    /* 
     * DMA channel 1 
     */
#define     DMA_CHAN1_BASE_ADDR     0x31000120
#define     DMACC1SrcAddr           (*(volatile unsigned long *)(DMA_CHAN1_BASE_ADDR + 0x00))
#define     DMACC1DestAddr          (*(volatile unsigned long *)(DMA_CHAN1_BASE_ADDR + 0x04))
#define     DMACC1LLI               (*(volatile unsigned long *)(DMA_CHAN1_BASE_ADDR + 0x08))
#define     DMACC1Control           (*(volatile unsigned long *)(DMA_CHAN1_BASE_ADDR + 0x0C))
#define     DMACC1Config            (*(volatile unsigned long *)(DMA_CHAN1_BASE_ADDR + 0x10))
   
    /* 
     * DMA channel 2 
     */
#define     DMA_CHAN2_BASE_ADDR     0x31000140
#define     DMACC2SrcAddr           (*(volatile unsigned long *)(DMA_CHAN2_BASE_ADDR + 0x00))
#define     DMACC2DestAddr          (*(volatile unsigned long *)(DMA_CHAN2_BASE_ADDR + 0x04))
#define     DMACC2LLI               (*(volatile unsigned long *)(DMA_CHAN2_BASE_ADDR + 0x08))
#define     DMACC2Control           (*(volatile unsigned long *)(DMA_CHAN2_BASE_ADDR + 0x0C))
#define     DMACC2Config            (*(volatile unsigned long *)(DMA_CHAN2_BASE_ADDR + 0x10))
  
    /* 
     * DMA channel 3 
     */
#define     DMA_CHAN3_BASE_ADDR     0x31000160
#define     DMACC3SrcAddr           (*(volatile unsigned long *)(DMA_CHAN3_BASE_ADDR + 0x00))
#define     DMACC3DestAddr          (*(volatile unsigned long *)(DMA_CHAN3_BASE_ADDR + 0x04))
#define     DMACC3LLI               (*(volatile unsigned long *)(DMA_CHAN3_BASE_ADDR + 0x08))
#define     DMACC3Control           (*(volatile unsigned long *)(DMA_CHAN3_BASE_ADDR + 0x0C))
#define     DMACC3Config            (*(volatile unsigned long *)(DMA_CHAN3_BASE_ADDR + 0x10))
  
    /* 
     * DMA channel 4 
     */
#define     DMA_CHAN4_BASE_ADDR     0x31000180
#define     DMACC4SrcAddr           (*(volatile unsigned long *)(DMA_CHAN4_BASE_ADDR + 0x00))
#define     DMACC4DestAddr          (*(volatile unsigned long *)(DMA_CHAN4_BASE_ADDR + 0x04))
#define     DMACC4LLI               (*(volatile unsigned long *)(DMA_CHAN4_BASE_ADDR + 0x08))
#define     DMACC4Control           (*(volatile unsigned long *)(DMA_CHAN4_BASE_ADDR + 0x0C))
#define     DMACC4Config            (*(volatile unsigned long *)(DMA_CHAN4_BASE_ADDR + 0x10))
    
    /* 
     * DMA channel 5 
     */
#define     DMA_CHAN5_BASE_ADDR     0x310001A0
#define     DMACC5SrcAddr           (*(volatile unsigned long *)(DMA_CHAN5_BASE_ADDR + 0x00))
#define     DMACC5DestAddr          (*(volatile unsigned long *)(DMA_CHAN5_BASE_ADDR + 0x04))
#define     DMACC5LLI               (*(volatile unsigned long *)(DMA_CHAN5_BASE_ADDR + 0x08))
#define     DMACC5Control           (*(volatile unsigned long *)(DMA_CHAN5_BASE_ADDR + 0x0C))
#define     DMACC5Config            (*(volatile unsigned long *)(DMA_CHAN5_BASE_ADDR + 0x10))
    
    /* 
     * DMA channel 6 
     */
#define     DMA_CHAN6_BASE_ADDR     0x310001C0
#define     DMACC6SrcAddr           (*(volatile unsigned long *)(DMA_CHAN6_BASE_ADDR + 0x00))
#define     DMACC6DestAddr          (*(volatile unsigned long *)(DMA_CHAN6_BASE_ADDR + 0x04))
#define     DMACC6LLI               (*(volatile unsigned long *)(DMA_CHAN6_BASE_ADDR + 0x08))
#define     DMACC6Control           (*(volatile unsigned long *)(DMA_CHAN6_BASE_ADDR + 0x0C))
#define     DMACC6Config            (*(volatile unsigned long *)(DMA_CHAN6_BASE_ADDR + 0x10))
  
    /* 
     * DMA channel 7 
     */
#define     DMA_CHAN7_BASE_ADDR     0x310001E0
#define     DMACC7SrcAddr           (*(volatile unsigned long *)(DMA_CHAN7_BASE_ADDR + 0x00))
#define     DMACC7DestAddr          (*(volatile unsigned long *)(DMA_CHAN7_BASE_ADDR + 0x04))
#define     DMACC7LLI               (*(volatile unsigned long *)(DMA_CHAN7_BASE_ADDR + 0x08))
#define     DMACC7Control           (*(volatile unsigned long *)(DMA_CHAN7_BASE_ADDR + 0x0C))
#define     DMACC7Config            (*(volatile unsigned long *)(DMA_CHAN7_BASE_ADDR + 0x10))

    /* 
     * SDRAM Control register 
     */
#define     SDRAM_CLK_BASE_ADDR	    0x40004000
#define     SDRAMCLK_CTRL	        (*(volatile unsigned long *)(SDRAM_CLK_BASE_ADDR + 0x68))

#define     SDRAM_BASE_ADDR		    0x31080000
#define     EMCControl	            (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x00))
#define     EMCStatus	            (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x04))
#define     EMCConfig	            (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x08))
#define     EMCDynamicControl	    (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x20))
#define     EMCDynamicRefresh	    (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x24))
#define     EMCDynamicReadConfig	(*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x28))
#define     EMCDynamicRP	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x30))
#define     EMCDynamicRAS	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x34))
#define     EMCDynamicSREX	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x38))
#define     EMCDynamicWR	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x44))
#define     EMCDynamicRC	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x48))
#define     EMCDynamicRFC	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x4C))
#define     EMCDynamicXSR	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x50))
#define     EMCDynamicRRD	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x54))
#define     EMCDynamicMRD	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x58))
#define     EMCDynamicCDLR	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x5C))
#define     EMCStaticExtendedWait   (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x80))

