yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
#define     EMCDynamicConfig0	    (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x100))
#define     EMCDynamicRasCas0	    (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x104))

#define     EMCDynamicConfig1	    (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x120))
#define     EMCDynamicRasCas1	    (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x124))

#define     EMCAHBControl0	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x400))
#define     EMCAHBStatus0	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x404))
#define     EMCAHBTimeout0	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x408))

#define     EMCAHBControl2	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x440))
#define     EMCAHBStatus2	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x444))
#define     EMCAHBTimeout2	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x448))

#define     EMCAHBControl3	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x460))
#define     EMCAHBStatus3	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x464))
#define     EMCAHBTimeout3	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x468))

#define     EMCAHBControl4	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x480))
#define     EMCAHBStatus4	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x484))
#define     EMCAHBTimeout4	        (*(volatile unsigned long *)(SDRAM_BASE_ADDR + 0x488))

#define     DDR_BASE_ADDR	        0x40004000
#define     DDR_LAP_NOM	            (*(volatile unsigned long *)(DDR_BASE_ADDR + 0x6C))
#define     DDR_LAP_COUNT	        (*(volatile unsigned long *)(DDR_BASE_ADDR + 0x70))
#define     DDR_CAL_DELAY	        (*(volatile unsigned long *)(DDR_BASE_ADDR + 0x74))

    /* 
     * EMC  static               
     */
#define     EMC_STATIC_BASE_ADDR    0x31080200
#define     EMCStaticConfig0        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x00))
#define     EMCStaticWaitWen0       (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x04))
#define     EMCStaticWaitOen0       (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x08))
#define     EMCStaticWaitRd0        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x0C))
#define     EMCStaticWaitPage0      (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x10))
#define     EMCStaticWaitWr0        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x14))
#define     EMCStaticWaitTurn0      (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x18))

#define     EMCStaticConfig1        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x20))
#define     EMCStaticWaitWen1       (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x24))
#define     EMCStaticWaitOen1       (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x28))
#define     EMCStaticWaitRd1        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x2C))
#define     EMCStaticWaitPage1      (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x30))
#define     EMCStaticWaitWr1        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x34))
#define     EMCStaticWaitTurn1      (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x38))

#define     EMCStaticConfig2        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x40))
#define     EMCStaticWaitWen2       (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x44))
#define     EMCStaticWaitOen2       (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x48))
#define     EMCStaticWaitRd2        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x4C))
#define     EMCStaticWaitPage2      (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x50))
#define     EMCStaticWaitWr2        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x54))
#define     EMCStaticWaitTurn2      (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x58))

#define     EMCStaticConfig3        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x60))
#define     EMCStaticWaitWen3       (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x64))
#define     EMCStaticWaitOen3       (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x68))
#define     EMCStaticWaitRd3        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x6C))
#define     EMCStaticWaitPage3      (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x70))
#define     EMCStaticWaitWr3        (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x74))
#define     EMCStaticWaitTurn3      (*(volatile unsigned long *)(EMC_STATIC_BASE_ADDR + 0x78))

    /* 
     * Multiple level NAND Flash 
     */
#define     MLC_BASE_ADDR	        0x200B8000
#define     MLC_CMD		            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x00))
#define     MLC_ADDR	            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x04))
#define     MLC_ECC_ENC_REG	        (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x08))
#define     MLC_ECC_DEC_REG	        (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x0C))
#define     MLC_ECC_AUTO_ENC_REG	(*(volatile unsigned long *)(MLC_BASE_ADDR + 0x10))
#define     MLC_ECC_AUTO_DEC_REG	(*(volatile unsigned long *)(MLC_BASE_ADDR + 0x14))
#define     MLC_RPR		            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x18))
#define     MLC_WPR		            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x1C))
#define     MLC_RUBP	            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x20))
#define     MLC_ROBP	            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x24))
#define     MLC_SW_WP_ADD_LOW	    (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x28))
#define     MLC_SW_WP_ADD_HIG	    (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x2C))
#define     MLC_ICR		            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x30))
#define     MLC_TIME_REG	        (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x34))
#define     MLC_IRQ_MR	            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x38))
#define     MLC_IRQ_SR	            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x3C))
#define     MLC_LOCK_PR	            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x44))
#define     MLC_ISR		            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x48))
#define     MLC_CEH		            (*(volatile unsigned long *)(MLC_BASE_ADDR + 0x4C))
    
