yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
    /* 
     * multiple level NAND Flash BUFF 
     */
#define     MLC_BUFF                (*(volatile unsigned long *)(0x200A8000))
#define     MLC_DATA                (*(volatile unsigned long *)(0x200B0000))

    /* 
     * Single level NAND Flash 
     */
#define     SLC_BASE_ADDR	        0x20020000
#define     SLC_DATA	            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x00))
#define     SLC_ADDR	            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x04))
#define     SLC_CMD		            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x08))
#define     SLC_STOP	            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x0C))
#define     SLC_CTRL	            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x10))
#define     SLC_CFG		            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x14))
#define     SLC_STAT	            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x18))
#define     SLC_INT_STAT	        (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x1C))
#define     SLC_IEN		            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x20))
#define     SLC_ISR		            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x24))
#define     SLC_ICR		            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x28))
#define     SLC_TAC		            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x2C))
#define     SLC_TC                  (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x30))
#define     SLC_ECC	                (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x34))
#define     SLC_DMA_DATA            (*(volatile unsigned long *)(SLC_BASE_ADDR + 0x38))

    /* 
     * LCD Controller  Registers 
     */
#define     LCD_BASE_ADDR           0x31040000
#define     LCD_TIMH                (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x000))
#define     LCD_TIMV                (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x004))
#define     LCD_POL                 (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x008))
#define     LCD_LE                  (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x00C))
#define     LCD_UPBASE              (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x010))
#define     LCD_LPBASE              (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x014))
#define     LCD_CTRL                (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x018))
#define     LCD_INTMSK              (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x01C))
#define     LCD_INTRAW              (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x020))
#define     LCD_INTSTAT             (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x024))
#define     LCD_INTCLR              (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x028))
#define     LCD_UPCURR              (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x02C))
#define     LCD_LPCURR              (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x030))
    
    /* 
     * LCD PAL 0x31040200 -> 0x310403FC 
     */
#define     LCD_PAL                 (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x200))
    
    /* 
     * LCD IMG 0x31040800 -> 0x31040BFC 
     */ 
#define     CRSR_IMG                (*(volatile unsigned long *)(LCD_BASE_ADDR + 0x800))
#define     CRSR_CTRL               (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC00)) 
#define     CRSR_CFG                (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC04))
#define     CRSR_PAL0               (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC08))
#define     CRSR_PAL1               (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC0C))
#define     CRSR_XY                 (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC10))
#define     CRSR_CLIP               (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC14))
#define     CRSR_INTMSK             (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC20))
#define     CRSR_INTCLR             (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC24))
#define     CRSR_INTRAW             (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC28))
#define     CRSR_INTSTAT            (*(volatile unsigned long *)(LCD_BASE_ADDR + 0xC2C))

    /* 
     * TOUCH Screen Register 
     */
#define     TOUCH_BASE_ADDR         0x40048000
#define     ADC_STAT                (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x00)) 
#define     ADC_SELECT              (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x04)) 
#define     ADC_CTRL                (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x08)) 
#define     TSC_SAMPLE_FIFO         (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x0c))         
#define     TSC_DTR                 (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x10)) 
#define     TSC_RTR                 (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x14)) 
#define     TSC_UTR                 (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x18)) 
#define     TSC_TTR                 (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x1C)) 
#define     TSC_DXP                 (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x20)) 
#define     TSC_MIN_X               (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x24))   
#define     TSC_MAX_X               (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x28))  
#define     TSC_MIN_Y               (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x2C))  
#define     TSC_MAX_Y               (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x30))   
#define     TSC_AUX_UTR             (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x34))    
#define     TSC_AUX_MIN             (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x38))    
#define     TSC_AUX_MAX             (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x3C))     
#define     TSC_AUX_VALUE           (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x44))      
#define     ADC_VALUE               (*(volatile unsigned long *)(TOUCH_BASE_ADDR + 0x48))   

    /* 
     * Keyboard Scan controller interface 
     */
#define     KS_BASE_ADDR		    0x40050000
#define     KS_DEB		            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x00))
#define     KS_STATE_COND	        (*(volatile unsigned long *)(KS_BASE_ADDR + 0x04))
#define     KS_IRQ		            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x08))
#define     KS_SCAN_CTL	            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x0C))
#define     KS_FAST_TST	            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x10))
#define     KS_MATRIX_DIM        	(*(volatile unsigned long *)(KS_BASE_ADDR + 0x14))
#define     KS_DATA0	            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x40))
#define     KS_DATA1	            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x44))
#define     KS_DATA2	            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x48))
#define     KS_DATA3	            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x4C))
#define     KS_DATA4            	(*(volatile unsigned long *)(KS_BASE_ADDR + 0x50))
#define     KS_DATA5	            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x54))
#define     KS_DATA6	            (*(volatile unsigned long *)(KS_BASE_ADDR + 0x58))
#define     KS_DATA7             	(*(volatile unsigned long *)(KS_BASE_ADDR + 0x5C))

