yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
    /* 
     * Ethernet controller  registers   
     */
#define     MAC_BASE_ADDR		    0x31060000 
#define     MAC_MAC1                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x000)) 
#define     MAC_MAC2                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x004)) 
#define     MAC_IPGT                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x008)) 
#define     MAC_IPGR                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x00C))
#define     MAC_CLRT                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x010))
#define     MAC_MAXF                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x014))
#define     MAC_SUPP                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x018))
#define     MAC_TEST                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x01C))
#define     MAC_MCFG                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x020))
#define     MAC_MCMD                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x024))
#define     MAC_MADR                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x028))
#define     MAC_MWTD                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x02C))
#define     MAC_MRDD                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x030))
#define     MAC_MIND                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x034))

#define     MAC_SA0                 (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x040)) 
#define     MAC_SA1                 (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x044)) 
#define     MAC_SA2                 (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x048)) 

#define     MAC_COMMAND             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x100)) 
#define     MAC_STATUS              (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x104)) 
#define     MAC_RXDESCRIPTOR        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x108)) 
#define     MAC_RXSTATUS            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x10C)) 
#define     MAC_RXDESCRIPTORNUM     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x110)) 
#define     MAC_RXPRODUCEINDEX      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x114)) 
#define     MAC_RXCONSUMEINDEX      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x118)) 
#define     MAC_TXDESCRIPTOR        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x11C)) 
#define     MAC_TXSTATUS            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x120)) 
#define     MAC_TXDESCRIPTORNUM     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x124)) 
#define     MAC_TXPRODUCEINDEX      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x128)) 
#define     MAC_TXCONSUMEINDEX      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x12C)) 

#define     MAC_TSV0                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x158)) 
#define     MAC_TSV1                (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x15C)) 
#define     MAC_RSV                 (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x160)) 

#define     MAC_FLOWCONTROLCNT      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x170)) 
#define     MAC_FLOWCONTROLSTS      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x174)) 

#define     MAC_RXFILTERCTRL        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x200))
#define     MAC_RXFILTERWOLSTS      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x204))
#define     MAC_RXFILTERWOLCLR      (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x208))

#define     MAC_HASHFILTERL         (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x210))
#define     MAC_HASHFILTERH         (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x214))

#define     MAC_INTSTATUS           (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE0))
#define     MAC_INTENABLE           (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE4))
#define     MAC_INTCLEAR            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE8))
#define     MAC_INTSET              (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFEC))

#define     MAC_POWERDOWN           (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFF4))
#define     MAC_MODULEID            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFFC))

    /* 
     * USB Device 
     */
#define     USB_BASE_ADDR		    0x31020200

#define     DEV_INT_STAT            (*(volatile unsigned long *)(USB_BASE_ADDR + 0x00))
#define     DEV_INT_EN              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x04))
#define     DEV_INT_CLR             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x08))
#define     DEV_INT_SET             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x0C))
#define     DEV_INT_PRIO            (*(volatile unsigned long *)(USB_BASE_ADDR + 0x2C))
#define     EP_INT_STAT             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x30))
#define     EP_INT_EN               (*(volatile unsigned long *)(USB_BASE_ADDR + 0x34))
#define     EP_INT_CLR              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x38))
#define     EP_INT_SET              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x3C))
#define     EP_INT_PRIO             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x40))
#define     REALIZE_EP              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x44))
#define     EP_INDEX                (*(volatile unsigned long *)(USB_BASE_ADDR + 0x48))
#define     MAXPACKET_SIZE          (*(volatile unsigned long *)(USB_BASE_ADDR + 0x4C))
#define     CMD_CODE                (*(volatile unsigned long *)(USB_BASE_ADDR + 0x10))
#define     CMD_DATA                (*(volatile unsigned long *)(USB_BASE_ADDR + 0x14))
#define     RX_DATA                 (*(volatile unsigned long *)(USB_BASE_ADDR + 0x18))
#define     TX_DATA                 (*(volatile unsigned long *)(USB_BASE_ADDR + 0x1C))
#define     RX_PLENGTH              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x20))
#define     TX_PLENGTH              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x24))
#define     USB_CTRL                (*(volatile unsigned long *)(USB_BASE_ADDR + 0x28))
#define     DC_REVISION             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x7C))

