yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
    /* 
     * USB DMA Registers 
     */
#define     DMA_REQ_STAT            (*(volatile unsigned long *)(USB_BASE_ADDR + 0x50))
#define     DMA_REQ_CLR             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x54))
#define     DMA_REQ_SET             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x58))
#define     UDCA_HEAD               (*(volatile unsigned long *)(USB_BASE_ADDR + 0x80))
#define     EP_DMA_STAT             (*(volatile unsigned long *)(USB_BASE_ADDR + 0x84))
#define     EP_DMA_EN               (*(volatile unsigned long *)(USB_BASE_ADDR + 0x88))
#define     EP_DMA_DIS              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x8C))
#define     DMA_INT_STAT            (*(volatile unsigned long *)(USB_BASE_ADDR + 0x90))
#define     DMA_INT_EN              (*(volatile unsigned long *)(USB_BASE_ADDR + 0x94))
#define     EOT_INT_STAT            (*(volatile unsigned long *)(USB_BASE_ADDR + 0xA0))
#define     EOT_INT_CLR             (*(volatile unsigned long *)(USB_BASE_ADDR + 0xA4))
#define     EOT_INT_SET             (*(volatile unsigned long *)(USB_BASE_ADDR + 0xA8))
#define     NDD_REQ_INT_STAT        (*(volatile unsigned long *)(USB_BASE_ADDR + 0xAC))
#define     NDD_REQ_INT_CLR         (*(volatile unsigned long *)(USB_BASE_ADDR + 0xB0))
#define     NDD_REQ_INT_SET         (*(volatile unsigned long *)(USB_BASE_ADDR + 0xB4))
#define     SYS_ERR_INT_STAT        (*(volatile unsigned long *)(USB_BASE_ADDR + 0xB8))
#define     SYS_ERR_INT_CLR         (*(volatile unsigned long *)(USB_BASE_ADDR + 0xBC))
#define     SYS_ERR_INT_SET         (*(volatile unsigned long *)(USB_BASE_ADDR + 0xC0))
#define     MODULE_ID               (*(volatile unsigned long *)(USB_BASE_ADDR + 0xFC))

    /* 
     * USB Host Controller 
     */
#define     USBH_BASE_ADDR	        0x31020000
#define     HcRevision	            (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x00))
#define     HcControl	            (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x04))
#define     HcCommandStatus	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x08))
#define     HcInterruptStatus	    (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x0C))
#define     HcInterruptEnable	    (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x10))
#define     HcInterruptDisable	    (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x14))
#define     HcHCCA		            (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x18))
#define     HcPeriodCurrentED	    (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x1C))
#define     HcControlHeadED	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x20))
#define     HcControlCurrentED	    (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x24))
#define     HcBulkHeadED	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x28))
#define     HcBulkCurrentED         (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x2C))
#define     HcDoneHead	            (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x30))
#define     HcFmInterval	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x34))
#define     HcFmRemaining	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x38))
#define     HcFmNumber	            (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x3C))
#define     HcPeriodicStart	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x40))
#define     HcLSThreshold	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x44))
#define     HcRhDescriptorA	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x48))
#define     HcRhDescriptorB	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x4C))
#define     HcRhStatus	            (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x50))
#define     HcRhPortStatus1	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x54))
#define     HcRhPortStatus2	        (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x58))
#define     HcModuleID	            (*(volatile unsigned long *)(USBH_BASE_ADDR + 0x5C))

    /* 
     * USB OTG 
     */
#define     USB_OTG_BASE_ADDR	    0x31020000
#define     OTG_INT_STATUS	        (*(volatile unsigned long *)(USB_OTG_BASE_ADDR + 0x100))
#define     OTG_INT_ENABLE	        (*(volatile unsigned long *)(USB_OTG_BASE_ADDR + 0x104))
#define     OTG_INT_SET             (*(volatile unsigned long *)(USB_OTG_BASE_ADDR + 0x108))
#define     OTG_INT_CLEAR	        (*(volatile unsigned long *)(USB_OTG_BASE_ADDR + 0x10C))
#define     OTG_STATUS   	        (*(volatile unsigned long *)(USB_OTG_BASE_ADDR + 0x110))
#define     OTG_TIMER	            (*(volatile unsigned long *)(USB_OTG_BASE_ADDR + 0x114))
#define     OTG_CLOCK_CONTROL	    (*(volatile unsigned long *)(USB_OTG_BASE_ADDR + 0xFF4))
#define     OTG_CLOCK_STATUS	    (*(volatile unsigned long *)(USB_OTG_BASE_ADDR + 0xFF8))
    
    /* 
     * USB OTG I2C register 
     */
#define     OTG_I2C_BASE_ADDR	    0x31020300
#define     I2C_RX		            (*(volatile unsigned long *)(OTG_I2C_BASE_ADDR + 0x00))
#define     I2C_TX		            (*(volatile unsigned long *)(OTG_I2C_BASE_ADDR + 0x00))
#define     I2C_STS		            (*(volatile unsigned long *)(OTG_I2C_BASE_ADDR + 0x04))
#define     I2C_CTL  	            (*(volatile unsigned long *)(OTG_I2C_BASE_ADDR + 0x08))
#define     I2C_CLKHI	            (*(volatile unsigned long *)(OTG_I2C_BASE_ADDR + 0x0C))
#define     I2C_CLKLO	            (*(volatile unsigned long *)(OTG_I2C_BASE_ADDR + 0x10))

    /* 
     * SD Card Interface 
     */
#define     MCI_BASE_ADDR	        0x20098000
#define     MCIPower                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x00))
#define     MCIClock                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x04))
#define     MCIArgument             (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x08))
#define     MCICommand              (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x0C))
#define     MCIRespCmd              (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x10))
#define     MCIResponse0            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x14))
#define     MCIResponse1            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x18))
#define     MCIResponse2            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x1C))
#define     MCIResponse3            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x20))
#define     MCIDataTimer            (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x24))
#define     MCIDataLength           (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x28))
#define     MCIDataCtrl             (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x2C))
#define     MCIDataCnt              (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x30))
#define     MCIStatus               (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x34))
#define     MCIClear                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x38))
#define     MCIMask0                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x3C))
#define     MCIMask1                (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x40))
#define     MCIFifoCnt              (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x48))
#define     MCIFIFO                 (*(volatile unsigned long *)(MCI_BASE_ADDR + 0x80))
    
