yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
    /*
     * Note: for FIFO register, the addr. is 0x20098080 through 0x200980BC 
     */
#define     SD_FIFO		            (*(volatile unsigned long *)(SD_BASE_ADDR + 0x80))


    /* 
     * Universal Asynchronous Receiver Transmitter (Standard UART3,4,5,6) 
     */
#define     UART3_BASE_ADDR		    0x40080000
#define     U3RBR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define     U3THR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define     U3DLL                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x00))
#define     U3DLM                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x04))
#define     U3IER                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x04))
#define     U3IIR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x08))
#define     U3FCR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x08))
#define     U3LCR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x0C))
#define     U3LSR                   (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x14))
#define     U3RXLEV                 (*(volatile unsigned long *)(UART3_BASE_ADDR + 0x1C))

#define     UART4_BASE_ADDR		    0x40088000
#define     U4RBR                   (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x00))
#define     U4THR                   (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x00))
#define     U4DLL                   (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x00))
#define     U4DLM                   (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x04))
#define     U4IER                   (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x04))
#define     U4IIR                   (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x08))
#define     U4FCR                   (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x08))
#define     U4LCR                   (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x0C))
#define     U4LSR                   (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x14))
#define     U4RXLEV                 (*(volatile unsigned long *)(UART4_BASE_ADDR + 0x1C))

#define     UART5_BASE_ADDR		    0x40090000
#define     U5RBR                   (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x00))
#define     U5THR                   (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x00))
#define     U5DLL                   (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x00))
#define     U5DLM                   (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x04))
#define     U5IER                   (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x04))
#define     U5IIR                   (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x08))
#define     U5FCR                   (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x08))
#define     U5LCR                   (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x0C))
#define     U5LSR                   (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x14))
#define     U5RXLEV                 (*(volatile unsigned long *)(UART5_BASE_ADDR + 0x1C))

#define     UART6_BASE_ADDR		    0x40098000
#define     U6RBR                   (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x00))
#define     U6THR                   (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x00))
#define     U6DLL                   (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x00))
#define     U6DLM                   (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x04))
#define     U6IER                   (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x04))
#define     U6IIR                   (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x08))
#define     U6FCR                   (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x08))
#define     U6LCR                   (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x0C))
#define     U6LSR                   (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x14))
#define     U6RXLEV                 (*(volatile unsigned long *)(UART6_BASE_ADDR + 0x1C))

#define     UART_CLK_BASE_ADDR	    0x40004000
#define     U3CLK                   (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xD0))
#define     U4CLK                   (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xD4))
#define     U5CLK                   (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xD8))
#define     U6CLK                   (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xDC))
#define     IRDACLK                 (*(volatile unsigned long *)(UART_CLK_BASE_ADDR + 0xE0))

#define     UART_CTRL_BASE_ADDR	    0x40054000
#define     UART_CTRL               (*(volatile unsigned long *)(UART_CTRL_BASE_ADDR + 0x00))
#define     UART_CLKMODE            (*(volatile unsigned long *)(UART_CTRL_BASE_ADDR + 0x04))
#define     UART_LOOP               (*(volatile unsigned long *)(UART_CTRL_BASE_ADDR + 0x08))

    /* 
     * High-speed Universal Asynchronous Receiver Transmitter (UART1,2,7) 
     */
#define     HS_UART1_BASE_ADDR		0x40014000
#define     HSU1_RX                 (*(volatile unsigned long *)(HS_UART1_BASE_ADDR + 0x00))
#define     HSU1_TX                 (*(volatile unsigned long *)(HS_UART1_BASE_ADDR + 0x00))
#define     HSU1_LEVEL              (*(volatile unsigned long *)(HS_UART1_BASE_ADDR + 0x04))
#define     HSU1_IIR                (*(volatile unsigned long *)(HS_UART1_BASE_ADDR + 0x08))
#define     HSU1_CTRL               (*(volatile unsigned long *)(HS_UART1_BASE_ADDR + 0x0C))
#define     HSU1_RATE               (*(volatile unsigned long *)(HS_UART1_BASE_ADDR + 0x10))

#define     HS_UART2_BASE_ADDR		0x40018000
#define     HSU2_RX                 (*(volatile unsigned long *)(HS_UART2_BASE_ADDR + 0x00))
#define     HSU2_TX                 (*(volatile unsigned long *)(HS_UART2_BASE_ADDR + 0x00))
#define     HSU2_LEVEL              (*(volatile unsigned long *)(HS_UART2_BASE_ADDR + 0x04))
#define     HSU2_IIR                (*(volatile unsigned long *)(HS_UART2_BASE_ADDR + 0x08))
#define     HSU2_CTRL               (*(volatile unsigned long *)(HS_UART2_BASE_ADDR + 0x0C))
#define     HSU2_RATE               (*(volatile unsigned long *)(HS_UART2_BASE_ADDR + 0x10))

#define     HS_UART7_BASE_ADDR		0x4001C000
#define     HSU7_RX                 (*(volatile unsigned long *)(HS_UART7_BASE_ADDR + 0x00))
#define     HSU7_TX                 (*(volatile unsigned long *)(HS_UART7_BASE_ADDR + 0x00))
#define     HSU7_LEVEL              (*(volatile unsigned long *)(HS_UART7_BASE_ADDR + 0x04))
#define     HSU7_IIR                (*(volatile unsigned long *)(HS_UART7_BASE_ADDR + 0x08))
#define     HSU7_CTRL               (*(volatile unsigned long *)(HS_UART7_BASE_ADDR + 0x0C))
#define     HSU7_RATE               (*(volatile unsigned long *)(HS_UART7_BASE_ADDR + 0x10))

