yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
    /* 
     * SPI Interface 
     */
#define     SPI1_BASE_ADDR	        0x20088000
#define     SPI1_GLOBAL             (*(volatile unsigned long *)(SPI1_BASE_ADDR + 0x000))
#define     SPI1_CON	            (*(volatile unsigned long *)(SPI1_BASE_ADDR + 0x004))
#define     SPI1_FRM	            (*(volatile unsigned long *)(SPI1_BASE_ADDR + 0x008))
#define     SPI1_IER	            (*(volatile unsigned long *)(SPI1_BASE_ADDR + 0x00C))
#define     SPI1_STAT	            (*(volatile unsigned long *)(SPI1_BASE_ADDR + 0x010))
#define     SPI1_DAT	            (*(volatile unsigned long *)(SPI1_BASE_ADDR + 0x014))
#define     SPI1_TIM_CTRL	        (*(volatile unsigned long *)(SPI1_BASE_ADDR + 0x400))
#define     SPI1_TIM_COUNT	        (*(volatile unsigned long *)(SPI1_BASE_ADDR + 0x404))
#define     SPI1_TIM_STAT	        (*(volatile unsigned long *)(SPI1_BASE_ADDR + 0x408))

#define     SPI2_BASE_ADDR	        0x20090000
#define     SPI2_GLOBAL	            (*(volatile unsigned long *)(SPI2_BASE_ADDR + 0x000))
#define     SPI2_CON	            (*(volatile unsigned long *)(SPI2_BASE_ADDR + 0x004))
#define     SPI2_FRM	            (*(volatile unsigned long *)(SPI2_BASE_ADDR + 0x008))
#define     SPI2_IER	            (*(volatile unsigned long *)(SPI2_BASE_ADDR + 0x00C))
#define     SPI2_STAT	            (*(volatile unsigned long *)(SPI2_BASE_ADDR + 0x010))
#define     SPI2_DAT	            (*(volatile unsigned long *)(SPI2_BASE_ADDR + 0x014))
#define     SPI2_TIM_CTRL	        (*(volatile unsigned long *)(SPI2_BASE_ADDR + 0x400))
#define     SPI2_TIM_COUNT	        (*(volatile unsigned long *)(SPI2_BASE_ADDR + 0x404))
#define     SPI2_TIM_STAT	        (*(volatile unsigned long *)(SPI2_BASE_ADDR + 0x408))

    /* 
     * SSP Interface 
     */
#define     SSP0_BASE_ADDR	        0x20084000
#define     SSP0CR0                 (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x000))
#define     SSP0CR1  	            (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x004))
#define     SSP0DR   	            (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x008))
#define     SSP0SR  	            (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x00C))
#define     SSP0CPSR	            (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x010))
#define     SSP0IMSC	            (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x014))
#define     SSP0RIS             	(*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x018))
#define     SSP0MIS     	        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x01C))
#define     SSP0ICR             	(*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x020))
#define     SSP0DMACR     	        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x024))

#define     SSP1_BASE_ADDR	        0x2008C000
#define     SSP1CR0                 (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x000))
#define     SSP1CR1  	            (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x004))
#define     SSP1DR   	            (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x008))
#define     SSP1SR  	            (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x00C))
#define     SSP1CPSR	            (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x010))
#define     SSP1IMSC                (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x014))
#define     SSP1RIS              	(*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x018))
#define     SSP1MIS     	        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x01C))
#define     SSP1ICR                 (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x020))
#define     SSP1DMACR     	        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x024))

    /* 
     * I2C Interface 1 
     */
#define     I2C1_BASE_ADDR		    0x400A0000
#define     I2C1_RX		            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x00))
#define     I2C1_TX		            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x00))
#define     I2C1_STAT	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x04))
#define     I2C1_CTRL	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x08))
#define     I2C1_CLKHI	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x0C))
#define     I2C1_CLKLO	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x10))
#define     I2C1_ADR	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x14))
#define     I2C1_RXFL	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x18))
#define     I2C1_TXFL	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x1C))
#define     I2C1_RXB	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x20))
#define     I2C1_TXB	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x24))
#define     I2C1_S_TX	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x28))
#define     I2C1_S_TXFL	            (*(volatile unsigned long *)(I2C1_BASE_ADDR + 0x2C))

    /* 
     * I2C Interface 2 
     */
#define     I2C2_BASE_ADDR		    0x400A8000
#define     I2C2_RX		            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x00))
#define     I2C2_TX		            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x00))
#define     I2C2_STAT	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x04))
#define     I2C2_CTRL	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x08))
#define     I2C2_CLKHI	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x0C))
#define     I2C2_CLKLO	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x10))
#define     I2C2_ADR	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x14))
#define     I2C2_RXFL	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x18))
#define     I2C2_TXFL	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x1C))
#define     I2C2_RXB	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x20))
#define     I2C2_TXB	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x24))
#define     I2C2_S_TX	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x28))
#define     I2C2_S_TXFL	            (*(volatile unsigned long *)(I2C2_BASE_ADDR + 0x2C)) 

