yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
    /*  
     * I2S  
     */
#define     I2S0_BASE_ADDR          0x20094000
#define     I2S0DAO                 (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x00))
#define     I2S0DAI                 (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x04))
#define     I2S0TXFIFO              (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x08))
#define     I2S0RXFIFO              (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x0C))
#define     I2S0STATE               (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x10))
#define     I2S0DMA0                (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x14))
#define     I2S0DMA1                (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x18))
#define     I2S0IRQ                 (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x1C))
#define     I2S0TXRATE              (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x20))
#define     I2S0RXRATE              (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x24))

#define     I2S1_BASE_ADDR          0x2009C000
#define     I2S1DAO                 (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x00))
#define     I2S1DAI                 (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x04))
#define     I2S1TXFIFO              (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x08))
#define     I2S1RXFIFO              (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x0C))
#define     I2S1STATE               (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x10))
#define     I2S1DMA0                (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x14))
#define     I2S1DMA1                (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x18))
#define     I2S1IRQ                 (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x1C))
#define     I2S1TXRATE              (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x20))
#define     I2S1RXRATE              (*(volatile unsigned long *)(I2S1_BASE_ADDR + 0x24)) 

    /* 
     * Standard timers 0/1/2/3        
     */
#define     TIMER0_BASE_ADDR        0x40044000
#define     T0IR                    (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x000))
#define     T0TCR                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x004))
#define     T0TC                    (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x008))
#define     T0PR                    (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x00C))
#define     T0PC                    (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x010))
#define     T0MCR                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x014))
#define     T0MR0                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x018))
#define     T0MR1                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x01C))
#define     T0MR2                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x020))
#define     T0MR3                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x024))
#define     T0CCR                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x028))
#define     T0CR0                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x02C))
#define     T0CR1                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x030))
#define     T0CR2                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x034))
#define     T0CR3                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x038))
#define     T0EMR                   (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x03C))
#define     T0CTCR                  (*(volatile unsigned long *)(TIMER0_BASE_ADDR + 0x070))


#define     TIMER1_BASE_ADDR         0x4004C000
#define     T1IR                    (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x000))
#define     T1TCR                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x004))
#define     T1TC                    (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x008))
#define     T1PR                    (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x00C))
#define     T1PC                    (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x010))
#define     T1MCR                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x014))
#define     T1MR0                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x018))
#define     T1MR1                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x01C))
#define     T1MR2                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x020))
#define     T1MR3                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x024))
#define     T1CCR                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x028))
#define     T1CR0                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x02C))
#define     T1CR1                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x030))
#define     T1CR2                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x034))
#define     T1CR3                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x038))
#define     T1EMR                   (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x03C))
#define     T1CTCR                  (*(volatile unsigned long *)(TIMER1_BASE_ADDR + 0x070))

#define     TIMER2_BASE_ADDR        0x40058000
#define     T2IR                    (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x000))
#define     T2TCR                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x004))
#define     T2TC                    (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x008))
#define     T2PR                    (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x00C))
#define     T2PC                    (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x010))
#define     T2MCR                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x014))
#define     T2MR0                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x018))
#define     T2MR1                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x01C))
#define     T2MR2                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x020))
#define     T2MR3                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x024))
#define     T2CCR                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x028))
#define     T2CR0                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x02C))
#define     T2CR1                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x030))
#define     T2CR2                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x034))
#define     T2CR3                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x038))
#define     T2EMR                   (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x03C))
#define     T2CTCR                  (*(volatile unsigned long *)(TIMER2_BASE_ADDR + 0x070))

#define     TIMER3_BASE_ADDR         0x40060000
#define     T3IR                    (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x000))
#define     T3TCR                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x004))
#define     T3TC                    (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x008))
#define     T3PR                    (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x00C))
#define     T3PC                    (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x010))
#define     T3MCR                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x014))
#define     T3MR0                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x018))
#define     T3MR1                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x01C))
#define     T3MR2                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x020))
#define     T3MR3                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x024))
#define     T3CCR                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x028))
#define     T3CR0                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x02C))
#define     T3CR1                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x030))
#define     T3CR2                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x034))
#define     T3CR3                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x038))
#define     T3EMR                   (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x03C))
#define     T3CTCR                  (*(volatile unsigned long *)(TIMER3_BASE_ADDR + 0x070))


