yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
    /* 
     * High-speed Timer  
     */
#define     HSTIM_BASE_ADDR		    0x40038000
#define     HSTIM_INT	            (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x00))
#define     HSTIM_CTRL	            (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x04))
#define     HSTIM_COUNTER	        (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x08))
#define     HSTIM_PMATCH	        (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x0C))
#define     HSTIM_PCOUNT	        (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x10))
#define     HSTIM_MCTRL	            (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x14))
#define     HSTIM_MATCH0	        (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x18))
#define     HSTIM_MATCH1	        (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x1C))
#define     HSTIM_MATCH2	        (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x20))
#define     HSTIM_CCR	            (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x28))
#define     HSTIM_CR0	            (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x2C))
#define     HSTIM_CR1	            (*(volatile unsigned long *)(HSTIM_BASE_ADDR + 0x30))


    /* 
     * Millisecond Timer 
     */
#define     MSTIM_BASE_ADDR		    0x40034000
#define     MSTIM_INT	            (*(volatile unsigned long *)(MSTIM_BASE_ADDR + 0x00))
#define     MSTIM_CTRL	            (*(volatile unsigned long *)(MSTIM_BASE_ADDR + 0x04))
#define     MSTIM_COUNTER	        (*(volatile unsigned long *)(MSTIM_BASE_ADDR + 0x08))
#define     MSTIM_MCTRL	            (*(volatile unsigned long *)(MSTIM_BASE_ADDR + 0x14))
#define     MSTIM_MATCH0	        (*(volatile unsigned long *)(MSTIM_BASE_ADDR + 0x18))
#define     MSTIM_MATCH1	        (*(volatile unsigned long *)(MSTIM_BASE_ADDR + 0x1C))


    /* 
     * Real Time Clock 
     */
#define     RTC_BASE_ADDR		    0x40024000
#define     RTC_UCOUNT	            (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x00))
#define     RTC_DCOUNT	            (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x04))
#define     RTC_MATCH0	            (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x08))
#define     RTC_MATCH1	            (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x0C))
#define     RTC_CTRL	            (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x10))
#define     RTC_INTSTAT             (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x14))
#define     RTC_KEY		            (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x18))
#define     RTC_SRAM	            (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x80))


    /* 
     * Watchdog timer 
     */
#define     WDTIM_BASE_ADDR		    0x4003C000
#define     WDTIM_INT	            (*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x00))
#define     WDTIM_CTRL	            (*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x04))
#define     WDTIM_COUNTER           (*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x08))
#define     WDTIM_MCTRL	            (*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x0C))
#define     WDTIM_MATCH0	        (*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x10))
#define     WDTIM_EMR	            (*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x14))
#define     WDTIM_PULSE	            (*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x18))
#define     WDTIM_RES	            (*(volatile unsigned long *)(WDTIM_BASE_ADDR + 0x1C))

    /* 
     * motor controller registers 
     */
#define     MOTOR_BASE_ADDR         0x400E8000
#define     MCCON                   (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x00))
#define     MCCON_SET               (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x04))    
#define     MCCON_CLR               (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x08))    
#define     MCCAPCON                (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x0C))   
#define     MCCAPCON_SET            (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x10))       
#define     MCCAPCON_CLR            (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x14))      
#define     MCTC0                   (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x18))
#define     MCTC1                   (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x1C))
#define     MCTC2                   (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x20))
#define     MCLIM0                  (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x24)) 
#define     MCLIM1                  (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x28)) 
#define     MCLIM2                  (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x2C)) 
#define     MCMAT0                  (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x30))
#define     MCMAT1                  (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x34)) 
#define     MCMAT2                  (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x38)) 
#define     MCDT                    (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x3C))
#define     MCCP                    (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x40)) 
#define     MCCAP0                  (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x44))
#define     MCCAP1                  (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x48)) 
#define     MCCAP2                  (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x4C))
#define     MCINTEN                 (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x50)) 
#define     MCINTEN_SET             (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x54))      
#define     MCINTEN_CLR             (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x58))     
#define     MCINTFLAG               (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x68))    
#define     MCINTFLAG_SET           (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x6C))        
#define     MCINTFLAG_CLR           (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x70))        
#define     MCCAP_CLR               (*(volatile unsigned long *)(MOTOR_BASE_ADDR + 0x74))   

    /* 
     * PWM controller registers    
     */
#define     PWM_BASE_ADDR           0x4005C000
#define     PWM1_CTRL               (*(volatile unsigned long *)(PWM_BASE_ADDR + 0x00))                  
#define     PWM2_CTRL               (*(volatile unsigned long *)(PWM_BASE_ADDR + 0x04))                 

