yzj19911001/55/YB3_0NT_Demo/SRC/SYSTEM/LPC3200.h
    /* 
     * IO  Controller registers 
     */
#define     MUX_BASE_ADDR           0x40028000
#define     P_MUX_SET               (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x100))
#define     P_MUX_CLR               (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x104))
#define     P_MUX_STATE             (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x108))
#define     P0_MUX_SET              (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x120))
#define     P0_MUX_CLR              (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x124))
#define     P0_MUX_STATE            (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x128))
#define     P1_MUX_SET              (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x130))
#define     P1_MUX_CLR              (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x134))
#define     P1_MUX_STATE            (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x138))
#define     P2_MUX_SET              (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x028))
#define     P2_MUX_CLR              (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x02C))
#define     P2_MUX_STATE            (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x030))
#define     P3_MUX_SET              (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x110))
#define     P3_MUX_CLR              (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x114))
#define     P3_MUX_STATE            (*(volatile unsigned long *)(MUX_BASE_ADDR + 0x118))

#define     P0_BASE_ADDR            0x40028040
#define     P0_INP_STATE            (*(volatile unsigned long *)(P0_BASE_ADDR + 0x00))
#define     P0_OUTP_SET             (*(volatile unsigned long *)(P0_BASE_ADDR + 0x04))
#define     P0_OUTP_CLR             (*(volatile unsigned long *)(P0_BASE_ADDR + 0x08))
#define     P0_OUTP_STATE           (*(volatile unsigned long *)(P0_BASE_ADDR + 0x0C))
#define     P0_DIR_SET              (*(volatile unsigned long *)(P0_BASE_ADDR + 0x10))
#define     P0_DIR_CLR              (*(volatile unsigned long *)(P0_BASE_ADDR + 0x14))
#define     P0_DIR_STATE            (*(volatile unsigned long *)(P0_BASE_ADDR + 0x18))

#define     P1_BASE_ADDR            0x40028060
#define     P1_INP_STATE            (*(volatile unsigned long *)(P1_BASE_ADDR + 0x00))
#define     P1_OUTP_SET             (*(volatile unsigned long *)(P1_BASE_ADDR + 0x04))
#define     P1_OUTP_CLR             (*(volatile unsigned long *)(P1_BASE_ADDR + 0x08))
#define     P1_OUTP_STATE           (*(volatile unsigned long *)(P1_BASE_ADDR + 0x0C))
#define     P1_DIR_SET              (*(volatile unsigned long *)(P1_BASE_ADDR + 0x10))
#define     P1_DIR_CLR              (*(volatile unsigned long *)(P1_BASE_ADDR + 0x14))
#define     P1_DIR_STATE            (*(volatile unsigned long *)(P1_BASE_ADDR + 0x18))

#define     P2_BASE_ADDR            0x40028010
#define     P2_INP_STATE            (*(volatile unsigned long *)(P2_BASE_ADDR + 0x0C))
#define     P2_OUTP_SET             (*(volatile unsigned long *)(P2_BASE_ADDR + 0x10))
#define     P2_OUTP_CLR             (*(volatile unsigned long *)(P2_BASE_ADDR + 0x14))
#define     P2_DIR_SET              (*(volatile unsigned long *)(P2_BASE_ADDR + 0x00))
#define     P2_DIR_CLR              (*(volatile unsigned long *)(P2_BASE_ADDR + 0x04))
#define     P2_DIR_STATE            (*(volatile unsigned long *)(P2_BASE_ADDR + 0x08))

#define     P3_BASE_ADDR            0x40028000
#define     P3_INP_STATE            (*(volatile unsigned long *)(P3_BASE_ADDR + 0x00))
#define     P3_OUTP_SET             (*(volatile unsigned long *)(P3_BASE_ADDR + 0x04))
#define     P3_OUTP_CLR             (*(volatile unsigned long *)(P3_BASE_ADDR + 0x08))
#define     P3_OUTP_STATE           (*(volatile unsigned long *)(P3_BASE_ADDR + 0x0C))

#endif                                                                  /* __LPC3250_H                  */

